app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Wood Shop"], ["room_number", 227], ["created_at", "2021-03-27 18:18:41.418950"], ["updated_at", "2021-03-27 18:18:41.418950"]]
---
  def create
    # @school_class = SchoolClass.new(class_params)
    # @school_class = SchoolClass.new
    # @school_class[:title] = params[:school_class][:title]
    # @school_class[:room_number] = params[:school_class][:room_number]
    @school_class = SchoolClass.new(class_params)
    @school_class.save

UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 35813], ["updated_at", "2021-03-27 18:29:26.535958"], ["id", 2]]
---
  def update

    @school_class = SchoolClass.update(class_params)