app/controllers/students_controller.rb

  def update
    @student = Student.update(student_params)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Mambo"], ["last_name", "Dogface"], ["updated_at", "2021-03-27 18:52:22.955892"], ["id", 1]]